dacalleg/micropython/ports/esp32/boards/NAVEL_ENC/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "NAVEL by Micronova Srl"
#define MICROPY_HW_MCU_NAME "ESP32"
